In [34]:
import pandas as pd
import numpy as np

# testeo
import string
import random

Funciones pandas

1. count()

  En Pandas se utiliza para contar el numero de celdas no nulas (no NA) en cada columna o fila de un Dataframe

In [3]:
# Ejemplo

data = {
  "Person": ["John", "Myla", "Lewis", "John", "Myla"],
  "Age": [24., np.nan, 21., 33, 26],
  "Single": [False, True, True, True, False]
}

df = pd.DataFrame(data = data)
df

  Person   Age  Single
0   John  24.0   False
1   Myla   NaN    True
2  Lewis  21.0    True
3   John  33.0    True
4   Myla  26.0   False

In [14]:
# Contar las celdas no nulas en cada columna
df.count()

Person    5
Age       4
Single    5
dtype: int64

In [9]:
# Para contar las celdas no nulas en cada fila
df.count(axis = 'columns')

0    3
1    2
2    3
3    3
4    3
dtype: int64

2. value_counts()

  Basicamente devuelve una Serie que contiene los valores unicos como indices y sus respectivas frecuencias como valores

In [23]:
# Ejemplo
data = {
  'num_legs': [2, 4, 4, 6],
  'num_wings': [2, 0, 0, 0]
}

df = pd.DataFrame(data = data, index = ['falcon', 'dog', 'cat', 'ant'])

# Contar la frecuencia de valores en la columna 'num_legs'
frecuencia = df.num_legs.value_counts()
frecuencia

num_legs
4    2
2    1
6    1
Name: count, dtype: int64

3. groupby()

  La funcion groupby divide un DataFrame en grupos segun los valores de una o mas columnas.

In [11]:
# Ejemplo #1

data = {
  'Producto': ['A', 'B', 'A', 'B', 'A'],
  'Region': ['Norte', 'Sur', 'Norte', 'Sur', 'Este'],
  'Ventas': [100, 150, 200 , 180, 120]
}

df = pd.DataFrame(data = data)

In [13]:
# Agrupamos los datos por la columna 'Region'

grouped_data = df.groupby(by = ['Region'])
grouped_data

In [14]:
# Luego, aplicamos la funcion agregado sum() para obtener la suma total de ventas por region

total_sales_by_region = grouped_data['Ventas'].sum()
total_sales_by_region

Region
Este     120
Norte    300
Sur      330
Name: Ventas, dtype: int64

In [128]:
# Ejemplo #2
# Supongamos que tenemos un Dataframe con datos de ventas de productos en diferentes regiones y queremos calcular el promedio de ventas por producto para cada a;o

# productos aleatorioas
letras = ['A', 'B', 'C']
letras_aleatorios = random.choices(population = letras, k = 10)

# regiones aleatorias
regiones = ['Norte', 'Sur', 'Este', 'Oeste']
regiones_aleatorias = random.choices(population = regiones, k = 10)

data = {
  'Year': np.random.randint(low = 2019, high = 2022, size = 10),
  'Productos': letras_aleatorios,
  'Region': regiones_aleatorias,
  'Ventas': np.round((np.random.random(10) * 100), 2)
}

new_df = pd.DataFrame(data = data)
new_df

   Year Productos Region  Ventas
0  2020         A  Norte   35.13
1  2021         A   Este   22.60
2  2021         B  Oeste   22.83
3  2021         C  Norte    4.70
4  2020         A  Oeste   59.69
5  2021         B    Sur   73.20
6  2021         A  Norte   48.16
7  2019         B  Oeste   55.21
8  2020         B   Este   57.96
9  2020         B  Oeste   22.80

In [136]:
# Agrupamos
grouped_data = new_df.groupby(by = ['Year', 'Productos']).mean(['Ventas'])
grouped_data

                Ventas
Year Productos
2019 B          55.210
2020 A          47.410
     B          40.380
2021 A          35.380
     B          48.015
     C           4.700

4. describe()

  Proporciona un resumen estadistico rapido y util de tus datos. Esta funcion devuelve:

    a. La media.
    b. La desviacion estandar.
    c. El minimo.
    d. El maximo.
    e. Los cuartiles de los datos

In [137]:
# Ejemplo #1

data  = {
  'A': [1, 2, 3, 4, 5],
  'B': [6, 7, 8, 9, 10],
  'C': [11, 12, 13, 14, 15]
}

df = pd.DataFrame(data = data)
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [138]:
# Usamos la funcion describe
resumen = df.describe()
resumen

              A          B          C
count  5.000000   5.000000   5.000000
mean   3.000000   8.000000  13.000000
std    1.581139   1.581139   1.581139
min    1.000000   6.000000  11.000000
25%    2.000000   7.000000  12.000000
50%    3.000000   8.000000  13.000000
75%    4.000000   9.000000  14.000000
max    5.000000  10.000000  15.000000

5. drop_duplicates()

  Elimina filas duplicadas de un Dataframe

In [152]:
# Ejemplo #1
df = pd.DataFrame({
  'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
  'B': ['one', 'one', 'one', 'three', 'two', 'two', 'one', 'three'],
  'C': [1, 2, 1, 4, 5, 6, 7, 8]
})

df

     A      B  C
0  foo    one  1
1  bar    one  2
2  foo    one  1
3  bar  three  4
4  foo    two  5
5  bar    two  6
6  foo    one  7
7  foo  three  8

In [160]:
# Eliminamos los duplicados

# Por default, elimina por filas que sean iguales
df_no_duplicates = df.drop_duplicates()
df_no_duplicates

     A      B  C
0  foo    one  1
1  bar    one  2
3  bar  three  4
4  foo    two  5
5  bar    two  6
6  foo    one  7
7  foo  three  8

Si nos fijamos en el frame original podemos ver que la posicion 0 y 2 son iguales, por ello se queda con la primera coincidencia y elimina las proximas en este caso solo la posicion 2

In [157]:
df.drop_duplicates(subset = ['A'])

     A    B  C
0  foo  one  1
1  bar  one  2

In [158]:
df.drop_duplicates(subset = ['B'])

     A      B  C
0  foo    one  1
3  bar  three  4
4  foo    two  5

In [159]:
df.drop_duplicates(subset = ['C'])

     A      B  C
0  foo    one  1
1  bar    one  2
3  bar  three  4
4  foo    two  5
5  bar    two  6
6  foo    one  7
7  foo  three  8

6. nunique()

  Se utiliza para obtener el numero de elementos unicos en un objeto de tipo Series o DataFrame

In [162]:
# Ejemplo #1

df = pd.DataFrame({
  'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
  'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
  'C': ['small', 'large', 'large', 'small', 'small', 'large', 'small', 'small'],
  'D': [1, 2, 2, 3, 3, 4, 5, 6],
  'E': [2, 4, 5, 5, 6, 6, 8, 9]
})

df

     A      B      C  D  E
0  foo    one  small  1  2
1  bar    one  large  2  4
2  foo    two  large  2  5
3  bar  three  small  3  5
4  foo    two  small  3  6
5  bar    two  large  4  6
6  foo    one  small  5  8
7  foo  three  small  6  9

In [163]:
# usamos la funcion nunique

df.nunique()

A    2
B    3
C    2
D    6
E    6
dtype: int64

In [164]:
df.nunique(axis = 1)

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
dtype: int64

7. query()

  Permite filtrar los datos de un DataFrame utilizando una cadena de consulta.

  Esta funcion es especialmente util cuando necesitas filtrar datos basados en condiciones complejas

In [165]:
# Ejemplo # 1

df = pd.DataFrame({
  'A': range(1, 6),
  'B': range(10, 60, 10),
  'C': range(100, 600, 100)
})

df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [167]:
# Usamos la funcion query
df_filtrado = df.query('A > 2 & B < 50')
df_filtrado

   A   B    C
2  3  30  300
3  4  40  400